rails/app/controllers/api/v1/appeals_controller.rb

SELECT "appeals".* FROM "appeals" ORDER BY created_at DESC
---
            def index
              @appeals = Appeal.all.order('created_at DESC')