app/controllers/api/v1/clinics_controller.rb

SELECT "clinics".* FROM "clinics" ORDER BY id DESC
---
            def index
              @clinics = Clinic.all.order('id DESC')