app/controllers/api/v1/users_controller.rb

SELECT COUNT(*) FROM "verifications" WHERE "verifications"."user_id" = $1 AND "verifications"."status" = $2  [["user_id", 1], ["status", "pending"]]
---
            def isloggedin
                if user_signed_in?
                  @user = current_user
                  if @user.verifications.where(status: "pending").count < 1