app/controllers/users/registrations_controller.rb

  def create
    super
    @profile = Profile.new(user_id: @user.id, account_type: "user", display_name: @user.email)
    puts @profile
    if @profile.save
---
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
INSERT INTO "profiles" ("user_id", "display_name", "account_type", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["display_name", "chelseaejw@gmail.com"], ["account_type", "user"], ["created_at", "2020-11-16 12:19:08.939254"], ["updated_at", "2020-11-16 12:19:08.939254"]]